app/controllers/images_controller.rb

SELECT * FROM `images`
---
  def index
    @images = Image.all

SELECT * FROM `images` WHERE (`images`.`id` = 1)
---
  def show
    @image = Image.find(params[:id])

INSERT INTO `images` (`name`, `created_at`, `image_file_name`, `image_file_size`, `updated_at`, `image_content_type`, `image_updated_at`) VALUES('New Image', '2010-12-07 06:36:33', 'Buster--63-.jpg', 386001, '2010-12-07 06:36:33', 'image/jpeg', '2010-12-07 06:36:31')
---
  def create
    @image = Image.new(params[:image])

    respond_to do |format|
      if @image.save

SELECT * FROM `images` WHERE (`images`.`id` = 1)
DELETE FROM `images` WHERE `id` = 1
---
  def destroy
    @image = Image.find(params[:id])
    @image.destroy